SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0020/MM32L0020_Application/Device/MM32L0020/Include/reg_i2c.h
/**
  * @brief I2C_SR Register Bit Definition
  */
#define I2C_SR_ACTIV_Pos                (0)
#define I2C_SR_ACTIV_Msk                (0x01U << I2C_SR_ACTIV_Pos)             /*!< I2C activity status */
#define I2C_SR_TFNF_Pos                 (1)
#define I2C_SR_TFNF_Msk                 (0x01U << I2C_SR_TFNF_Pos)              /*!< Transmit FIFO not full */
#define I2C_SR_TFE_Pos                  (2)
#define I2C_SR_TFE_Msk                  (0x01U << I2C_SR_TFE_Pos)               /*!< Transmit FIFO completely empty */
#define I2C_SR_RFNE_Pos                 (3)
#define I2C_SR_RFNE_Msk                 (0x01U << I2C_SR_RFNE_Pos)              /*!< Receive FIFO not empty */
#define I2C_SR_RFF_Pos                  (4)
#define I2C_SR_RFF_Msk                  (0x01U << I2C_SR_RFF_Pos)               /*!< Receive FIFO completely full */
#define I2C_SR_MST_ACTIV_Pos            (5)
#define I2C_SR_MST_ACTIV_Msk            (0x01U << I2C_SR_MST_ACTIV_Pos)         /*!< Master FSM activity status */
#define I2C_SR_SLV_ACTIV_Pos            (6)
#define I2C_SR_SLV_ACTIV_Msk            (0x01U << I2C_SR_SLV_ACTIV_Pos)         /*!< Slave FSM activity status */

/**
  * @brief I2C_TXFLR Register Bit Definition
  */
#define I2C_TXFLR_CNT_Pos               (0)
#define I2C_TXFLR_CNT_Msk               (0x03U << I2C_TXFLR_CNT_Pos)            /*!< Number of valid data in the transmit FIFO */

/**
  * @brief I2C_RXFLR Register Bit Definition
  */
#define I2C_RXFLR_CNT_Pos               (0)
#define I2C_RXFLR_CNT_Msk               (0x03U << I2C_RXFLR_CNT_Pos)            /*!< Number of valid data in the receive FIFO */

/**
  * @brief I2C_HOLD Register Bit Definition
  */
#define I2C_HOLD_TXCNT_Pos              (0)
#define I2C_HOLD_TXCNT_Msk              (0xFFFFU << I2C_HOLD_TXCNT_Pos)         /*!< SDA hold time when I2C acts as a transmit */
#define I2C_HOLD_RXCNT_Pos              (16)
#define I2C_HOLD_RXCNT_Msk              (0xFFU << I2C_HOLD_RXCNT_Pos)           /*!< SDA hold time when I2C acts as a receiver */

/**
  * @brief I2C_DMA Register Bit Definition
  */
#define I2C_DMA_RXEN_Pos                (0)
#define I2C_DMA_RXEN_Msk                (0x01U << I2C_DMA_RXEN_Pos)             /*!< Receive DMA enable */
#define I2C_DMA_TXEN_Pos                (1)
#define I2C_DMA_TXEN_Msk                (0x01U << I2C_DMA_TXEN_Pos)             /*!< Transmit DMA enable */

/**
  * @brief I2C_SETUP Register Bit Definition
  */
#define I2C_SETUP_CNT_Pos               (0)
#define I2C_SETUP_CNT_Msk               (0xFFU << I2C_SETUP_CNT_Pos)            /*!< SDA setup */

/**
  * @brief I2C_GCR Register Bit Definition
  */
#define I2C_GCR_GC_Pos                  (0)
#define I2C_GCR_GC_Msk                  (0x01U << I2C_GCR_GC_Pos)               /*!< ACK general call */

/**
  * @brief I2C_SLVMASK Register Bit Definition
  */
#define I2C_SLVMASK_MASK_Pos            (0)
#define I2C_SLVMASK_MASK_Msk            (0x3FFU << I2C_SLVMASK_MASK_Pos)        /*!< Slave address mask */

/**
  * @brief I2C_SLVRCVADDR Register Bit Definition
  */
#define I2C_SLVRCVADDR_ADDR_Pos         (0)
#define I2C_SLVRCVADDR_ADDR_Msk         (0x3FFU << I2C_SLVRCVADDR_ADDR_Pos)     /*!< Slave address actually received by I2C */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#ifdef __cplusplus
}
#endif

/** --------------------------------------------------------------------------*/
#endif
/** --------------------------------------------------------------------------*/
